![](NotebookHeader.jpg)

### Course : Python for Data ScienceÂ¶
## Lesson : Pandas - Data manipulation using DataFrame (beyond 1d !)

## A - Creating Dataframe

### A1 : Getting Started with DataFrame

In [1]:
import pandas as pd                         # Importing Pandas library
from pandas import DataFrame, Series        # Importing Multiple Objects                 
import numpy as np

In [7]:
lst = ['a', 'b']
type(lst)

list

In [9]:
tpl = ('a','b')
tpl

('a', 'b')

In [2]:
from pandas import DataFrame as df

In [3]:
df = pd.DataFrame( [ [10, 20], ['A', 'B'] ] )
df

    0   1
0  10  20
1   A   B

In [10]:
df = pd.DataFrame( [20, 30] )
df

    0
0  20
1  30

### A2 - Create a dataframe using Dictionary of Series method

In [101]:
s_countries  = Series(['USA', 'UK', 'Germany', 'India','Australia'])
s_capital    = Series(['Washington DC', 'London', 'Berlin', 'New Delhi', 'Canberra'])
s_population = Series([6, 9, 3.5, 19, 0.5])

In [8]:
s_countries

0          USA
1           UK
2      Germany
3        India
4          NaN
5    Australia
dtype: object

In [5]:
s_capital

0    Washington DC
1           London
2           Berlin
3        New Delhi
4         Canberra
dtype: object

In [6]:
s_population

0     6.0
1     9.0
2     3.5
3    19.0
4     0.5
dtype: float64

In [102]:
data = {'country':s_countries, 
        'capital': s_capital, 
        'pop_in_mi': s_population
        }
df1 = pd.DataFrame(data)      # Now you should have a nice table like dataset which you can work on
df1

     country        capital  pop_in_mi
0        USA  Washington DC        6.0
1         UK         London        9.0
2    Germany         Berlin        3.5
3      India      New Delhi       19.0
4  Australia       Canberra        0.5

### A3 - Creating DataFrame using Nested Dictionaries

In [12]:
# One other method to create a dataframe is to use dictionary of dictionary
# In doing so, keys from outer dictionary will be used as columns and keys from inner dictionary will be used a  rows

s_dict = {'Washington DC': {'2010': 6, '2015': 6*1.2,  '2020': 6*1.2*1.2},
          'London': {'2010': 9, '2015': 9*1.1,  '2020': 9*1.1*1.1},
          'India': {'2010': 19, '2015': 19*1.1,  '2020': 19*1.1*1.1}
         }
df_nested = pd.DataFrame(s_dict)
df_nested

      Washington DC  London  India
2010           6.00    9.00  19.00
2015           7.20    9.90  20.90
2020           8.64   10.89  22.99

In [13]:
df_nested.values         # will return an m-dimensional array

array([[ 6.  ,  9.  , 19.  ],
       [ 7.2 ,  9.9 , 20.9 ],
       [ 8.64, 10.89, 22.99]])

In [14]:
df_nested.columns

Index(['Washington DC', 'London', 'India'], dtype='object')

In [16]:
df_nested.index

Index(['2010', '2015', '2020'], dtype='object')

## B Updating Metadata

### B1 - Assigning Column names

In [107]:
df2 = pd.DataFrame(data, columns = ['country', 'capital', 'pop_in_mi']) # can assign columns while creating the Dataframe
df2

     country        capital  pop_in_mi
0        USA  Washington DC        6.0
1         UK         London        9.0
2    Germany         Berlin        3.5
3      India      New Delhi       19.0
4  Australia       Canberra        0.5

### B2 - Renaming Column

In [27]:
df2

     country        capital  POPULATION IN MILLION
0        USA  Washington DC                    6.0
1         UK         London                    9.0
2    Germany         Berlin                    3.5
3      India      New Delhi                   19.0
4        NaN       Canberra                    0.5
5  Australia            NaN                    NaN

In [25]:
df2.rename(columns = {'pop_in_mi':'POPULATION IN MILLION'}, inplace=True)
df2

     country        capital  POPULATION IN MILLION
0        USA  Washington DC                    6.0
1         UK         London                    9.0
2    Germany         Berlin                    3.5
3      India      New Delhi                   19.0
4        NaN       Canberra                    0.5
5  Australia            NaN                    NaN

### B3 - Assigning Names to Index (for rows)

In [28]:
df2.index = ['one','two','three','four','five', 'sixth']
df2

         country        capital  POPULATION IN MILLION
one          USA  Washington DC                    6.0
two           UK         London                    9.0
three    Germany         Berlin                    3.5
four       India      New Delhi                   19.0
five         NaN       Canberra                    0.5
sixth  Australia            NaN                    NaN

### B4 Generating Index and using the generated values to assign as row ids

In [33]:
np.arange(1001, 1010,1)

array([1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009])

In [34]:
u_index =  pd.Index(np.arange(1001, 1004))
df = pd.DataFrame(s_dict )
df.index = u_index
df

      Washington DC  London  India
1001           6.00    9.00  19.00
1002           7.20    9.90  20.90
1003           8.64   10.89  22.99

In [35]:
df.reset_index()          # Will copy current index value as a column and give you sequential index. You can use this as column

   index  Washington DC  London  India
0   1001           6.00    9.00  19.00
1   1002           7.20    9.90  20.90
2   1003           8.64   10.89  22.99

## C - Data Inspection

### C1 - Retrieving Column values

In [46]:
# Balaji to get an example for dynamic
collist = df2.columns
str1 = 'country'
cond = str1 not in collist
collist[cond]

array([], shape=(0, 3), dtype=object)

In [47]:
collist = ['capital', 'country']
df2[collist]           # Retrieve using dict-like notation - returns a series

             capital    country
one    Washington DC        USA
two           London         UK
three         Berlin    Germany
four       New Delhi      India
five        Canberra        NaN
sixth            NaN  Australia

In [48]:
s1 = df2.capital      # Note the indexes are same as those of dataframe
s1

one      Washington DC
two             London
three           Berlin
four         New Delhi
five          Canberra
sixth              NaN
Name: capital, dtype: object

In [55]:
df2.rename(columns = {'POPULATION IN MILLION':'population'}, inplace=True)
df2

         country        capital  population
one          USA  Washington DC         6.0
two           UK         London         9.0
three    Germany         Berlin         3.5
four       India      New Delhi        19.0
five         NaN       Canberra         0.5
sixth  Australia            NaN         NaN

In [56]:
df2.population.max()              # Alternative notation

19.0

### C2 - Retriving rows : Position based

In [57]:
df2.loc['two']       # Using loc - use index names or labels provided or set

country           UK
capital       London
population         9
Name: two, dtype: object

In [60]:
df2.iloc[1]         # Using iloc - Returns the second row. Positional index

country           UK
capital       London
population         9
Name: two, dtype: object

In [58]:
rowlist = ['two','four']      # Retriving list of rows
df2.loc[rowlist]

     country    capital  population
two       UK     London         9.0
four   India  New Delhi        19.0

In [61]:
rowlist = ['two','four']             # Retriving list of rows
collist = ['capital','country']      # Retriving list of columns - specify ordering
df2.loc[rowlist, collist]

        capital country
two      London      UK
four  New Delhi   India

In [63]:
df2.rename(columns = {'pop_in_mi':'population'}, inplace=True)
df2

         country        capital  population
one          USA  Washington DC         6.0
two           UK         London         9.0
three    Germany         Berlin         3.5
four       India      New Delhi        19.0
five         NaN       Canberra         0.5
sixth  Australia            NaN         NaN

### C3 - Retriving rows based on conditions (filtering)

In [64]:
cond1 = df2.population > 5           # Specify a condition and retrieve
df2[cond1]

     country        capital  population
one      USA  Washington DC         6.0
two       UK         London         9.0
four   India      New Delhi        19.0

In [67]:
cond2 = df2.population > 10
df2.loc[cond2, ['population']] = 50 
df2

         country        capital  population
one          USA  Washington DC         6.0
two           UK         London         9.0
three    Germany         Berlin         3.5
four       India      New Delhi        50.0
five         NaN       Canberra         0.5
sixth  Australia            NaN         NaN

In [79]:
df2.loc[df2.population == '5', 'population']
df2

       country        capital population
one        USA  Washington DC          6
two         UK         London          9
three  Germany         Berlin        3.5
four     India      New Delhi         50
five       NaN       Canberra        0.5
sixth        5              5          5

In [83]:
df2.loc[:,['population', 'capital']]

      population        capital
one            6  Washington DC
two            9         London
three        3.5         Berlin
four          50      New Delhi
five         0.5       Canberra
sixth          5              5

In [74]:
# Retrive all rows using positional values but selected columns
df3.iloc[:, [4]]              # -1 will retrive the last column i.e. the newly added column values

   population_new
0           11.76
1           17.64
2            6.86
3           98.00
4            0.98

In [76]:
# Retrive all rows using index values but selected columns
df3.loc[:, ['population_new']] 
df3.population_new

0    11.76
1    17.64
2     6.86
3    98.00
4     0.98
Name: population_new, dtype: float64

In [86]:
df2.iloc[:, [-1]]              # -1 will retrive the last column i.e. the newly added column values

      population
one            6
two            9
three        3.5
four          50
five         0.5
sixth          5

In [89]:
tmpdf = df2.iloc[:, [1,2]]              # Retrieve original population and new population both columns
tmpdf

             capital population
one    Washington DC          6
two           London          9
three         Berlin        3.5
four       New Delhi         50
five        Canberra        0.5
sixth              5          5

In [91]:
df2.iloc[:, 0:2]           # Retrieve range of columns

       country        capital
one        USA  Washington DC
two         UK         London
three  Germany         Berlin
four     India      New Delhi
five       NaN       Canberra
sixth        5              5

In [83]:
df3[['population','population_new']]          # Another method is to use column list or column names explicitly

   population  population_new
0         6.0           11.76
1         9.0           17.64
2         3.5            6.86
3        19.0           98.00
4         0.5            0.98

### C4 Ordering : Sorting and Ranking

In [93]:
df2.sort_index()          # Here values are already sorted by you can change values and check in other dataset
df2

       country        capital population
one        USA  Washington DC          6
two         UK         London          9
three  Germany         Berlin        3.5
four     India      New Delhi         50
five       NaN       Canberra        0.5
sixth        5              5          5

In [94]:
df2.sort_index(axis=0,ascending = False)  # axis 0 for index or rows

       country        capital population
two         UK         London          9
three  Germany         Berlin        3.5
sixth        5              5          5
one        USA  Washington DC          6
four     India      New Delhi         50
five       NaN       Canberra        0.5

In [98]:
df2.sort_index(axis=1,ascending = True)  # axis 1 for columns   - Washington should come at end

             capital  country population
one    Washington DC      USA          6
two           London       UK          9
three         Berlin  Germany        3.5
four       New Delhi    India         50
five        Canberra      NaN        0.5
sixth              5        5          5

In [99]:
df2.rank()    # Rank ordering of values

Empty DataFrame
Columns: []
Index: [one, two, three, four, five, sixth]

## D - Data Preparation / Updates

### D1 - Changing DataFrame Values / Rows

In [108]:
df1.rename(columns = {'pop_in_mi':'population'}, inplace=True)
df1

     country        capital  population
0        USA  Washington DC         8.4
1         UK         London        12.6
2    Germany         Berlin         4.9
3      India      New Delhi        26.6
4  Australia       Canberra         0.7

In [109]:
# Example we want to uplate the population by 40%
df3 = df1.copy()
# df3 = df2          # Make a copy
df3['population'] = df3['population'] * 1.4
df3

     country        capital  population
0        USA  Washington DC       11.76
1         UK         London       17.64
2    Germany         Berlin        6.86
3      India      New Delhi       37.24
4  Australia       Canberra        0.98

In [110]:
df1

     country        capital  population
0        USA  Washington DC         8.4
1         UK         London        12.6
2    Germany         Berlin         4.9
3      India      New Delhi        26.6
4  Australia       Canberra         0.7

In [58]:
print("Data frame df2 ", df2)

Data frame df2       country        capital  population
0        USA  Washington DC         8.4
1         UK         London        12.6
2    Germany         Berlin         4.9
3      India      New Delhi        70.0
4  Australia       Canberra         0.7

In [73]:
print("Data frame df3 ", df3)   # Observe that Changing df3 also changes df2 or original dataframe. So it was not a true copy

Data frame df3           country        capital  population
one          USA  Washington DC         6.0
two           UK         London         9.0
three    Germany         Berlin         3.5
four       India      New Delhi        19.0
five   Australia       Canberra         0.5

### D2 - Reset to original values

In [112]:
df1.index = ['one','two','three','four','five']
df1

         country        capital  population
one          USA  Washington DC         8.4
two           UK         London        12.6
three    Germany         Berlin         4.9
four       India      New Delhi        26.6
five   Australia       Canberra         0.7

In [69]:
#To reset the population to original values
s_population.index = df3.index # Remember we renamed the index of dataframe. So first align the index of the Series to Dataframe
df3.population = s_population  # assign values to a column
df3

         country        capital  population
one          USA  Washington DC         6.0
two           UK         London         9.0
three    Germany         Berlin         3.5
four       India      New Delhi        19.0
five   Australia       Canberra         0.5

In [59]:
df3 = df2.copy()           # Make a copy - Important to be aware of true copy versus reference
df3['population'] = df3['population'] * 1.4
df3

     country        capital  population
0        USA  Washington DC       11.76
1         UK         London       17.64
2    Germany         Berlin        6.86
3      India      New Delhi       98.00
4  Australia       Canberra        0.98

In [60]:
df2               # Now since we used copy method, the original dataframe doesn't get changed.

     country        capital  population
0        USA  Washington DC         8.4
1         UK         London        12.6
2    Germany         Berlin         4.9
3      India      New Delhi        70.0
4  Australia       Canberra         0.7

### D3 = Changing DataFrame Columns

In [62]:
df3['area'] = 10         # Assigning a column that doesn't exist will create a new column
df3

In [67]:
s_population

0     6.0
1     9.0
2     3.5
3    19.0
4     0.5
dtype: float64

### D4 - Creating a new column

In [9]:
df3['population_new'] = df3['population']

NameError: name 'df3' is not defined

In [71]:
df3['population'] = s_population
df3

     country        capital  population  area  population_new
0        USA  Washington DC         6.0    10           11.76
1         UK         London         9.0    10           17.64
2    Germany         Berlin         3.5    10            6.86
3      India      New Delhi        19.0    10           98.00
4  Australia       Canberra         0.5    10            0.98

### D5 - Vectorized Operations on Dataframe

In [112]:
df4 = df3.copy()
df4['population_new'] = df4['population'] * 1.4
df4['pop_diff'] = df4['population_new'] - df4['population']

         country        capital  population  area  population_new  pop_diff
one          USA  Washington DC         6.0    10             8.4       2.4
two           UK         London         9.0    10            12.6       3.6
three    Germany         Berlin         3.5    10             4.9       1.4
four       India      New Delhi        19.0    10            26.6       7.6
five   Australia       Canberra         0.5    10             0.7       0.2

In [113]:
df_new = df1.copy()
df_new['population_new'] = df1['population'] * 1.4
df_new

         country        capital  population  population_new
one          USA  Washington DC         8.4           11.76
two           UK         London        12.6           17.64
three    Germany         Berlin         4.9            6.86
four       India      New Delhi        26.6           37.24
five   Australia       Canberra         0.7            0.98

In [115]:
df_new['pop_diff'] = df_new['population_new'] - df_new['population']
df_new

         country        capital  population  population_new  pop_diff
one          USA  Washington DC         8.4           11.76      3.36
two           UK         London        12.6           17.64      5.04
three    Germany         Berlin         4.9            6.86      1.96
four       India      New Delhi        26.6           37.24     10.64
five   Australia       Canberra         0.7            0.98      0.28

In [117]:
df_new.T              # Transpose

                          one     two    three       four       five
country                   USA      UK  Germany      India  Australia
capital         Washington DC  London   Berlin  New Delhi   Canberra
population                8.4    12.6      4.9       26.6        0.7
population_new          11.76   17.64     6.86      37.24       0.98
pop_diff                 3.36    5.04     1.96      10.64       0.28

### D6 - Checking for membership

In [131]:
'London' in df_new['capital']
df_new

         country        capital  population  population_new  pop_diff
one          USA  Washington DC         8.4           11.76      3.36
two           UK         London        12.6           17.64      5.04
three    Germany         Berlin         4.9            6.86      1.96
four       India      New Delhi        26.6           37.24     10.64
five   Australia       Canberra         0.7            0.98      0.28

In [130]:
df_nested
'2015' in df_nested.index

True

In [135]:
# Dropping values 
df5 = df_new.copy()
df5 = df5.drop('pop_diff', axis=1) 
df5

         country        capital  population  population_new
one          USA  Washington DC         8.4           11.76
two           UK         London        12.6           17.64
three    Germany         Berlin         4.9            6.86
four       India      New Delhi        26.6           37.24
five   Australia       Canberra         0.7            0.98

### D7 - Applying a function or methods

In [136]:
 def fn1(x):                        
     return x.max() - x.min()

In [139]:
df5[['population','population_new']].max()

population        26.60
population_new    37.24
dtype: float64

#### Another way of expressing the function - Lambda expression or function - simpler method

In [148]:
fn = lambda x: x.max() - x.min()                 # Could be other statistical functions
df5 = df
df5.apply(fn)

Washington DC    2.64
London           1.89
India            3.99
dtype: float64

In [147]:
df5

      Washington DC  London  India
1001           6.00    9.00  19.00
1002           7.20    9.90  20.90
1003           8.64   10.89  22.99

#### Instead of one scalar value, we can return a series of values

In [158]:
 def fn_series(x):
     return Series([x.min(), x.max(), x.max() - x.min()], index=['minimum', 'maximum', 'range'])

In [159]:
df5 = df
df5.apply(fn_series)

         Washington DC  London  India
minimum           6.00    9.00  19.00
maximum           8.64   10.89  22.99
range             2.64    1.89   3.99